app/controllers/comments_controller.rb

  def index
    @comments = params[:post_id] ? Comment.find(:all, :conditions => {:comment_post_ID => Post.find_by_post_name(params[:post_id], :select => :id).id}) : Comment.find(:all)
---
SELECT * FROM `wp_comments` WHERE (`wp_comments`.`comment_post_ID` = 'hello-world')
SELECT id FROM `wp_posts` WHERE (`wp_posts`.`post_name` = 'hello-world') LIMIT 1