app/controllers/posts_controller.rb

SELECT * FROM `wp_posts` WHERE (post_date <= '2009-08-07 20:32:09' AND post_type = 'post') ORDER BY post_date DESC LIMIT 10
---
  def index

    posts_count = params[:format] ? options['posts_per_page'] : options['posts_per_rss']
    @posts = Post.find(:all, :conditions => ['post_date <= ? AND post_type = ?', Time.now, 'post'], :order => 'post_date DESC', :limit => posts_count)

SELECT * FROM `wp_posts` WHERE (`wp_posts`.`post_name` = 'feed') LIMIT 1
---
  def show
    @post = Post.find_by_post_name(params[:post_name]||params[:id])

SELECT * FROM `wp_posts` WHERE (`wp_posts`.`post_name` = 'hello-world') LIMIT 1
---
  def edit
    @post = Post.find_by_post_name(params[:id])