app/controllers/user_sessions_controller.rb

  def create
    return redirect_to(sign_url) unless params[:login] && params[:pass]

    logger.info(params[:login])

    @user = User.find_by_user_login_and_user_pass(params[:login], Digest::MD5.hexdigest(params[:pass]))
---
SELECT * FROM `wp_users` WHERE (`wp_users`.`user_login` = 'admin' AND `wp_users`.`user_pass` = '8e7ec3b723f0f02641d0ac5cabd79462') LIMIT 1